# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'tree' # List directories in a tree structure

# Development
brew 'php'
brew 'composer'
brew 'node'

# Apps
cask '1password'
cask 'alfred'
cask 'discord'
cask 'doxie'
cask 'firefox'
cask 'google-chrome'
cask 'harvest'
cask 'iterm2'
cask 'microsoft-teams'
cask 'miro'
cask 'phpstorm'
cask 'postman'
cask 'rectangle'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'transmission'
cask 'virtualbox'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
